{
  "A1": {
    "Be (am/is/are)": {
      "Daily Routines": [
        "Are you usually busy in the morning?",
        "Is your routine the same every day?",
        "What is your favorite time of day?",
        "Are you tired after work or school?",
        "Is your weekend different from your weekday?",
        "Are you someone who wakes up early?",
        "Is your schedule flexible or fixed?",
        "Are mornings easy or difficult for you?",
        "Are your evenings relaxing?",
        "What is your normal bedtime?"
      ],
      "Work": [
        "Are you a student or a worker?",
        "Is your job interesting?",
        "Are your coworkers friendly?",
        "Is your workplace noisy or quiet?",
        "Are you busy at work these days?",
        "Is your office close to your home?",
        "Is your job easy or difficult?",
        "Is your manager helpful?",
        "Are you at your desk most of the day?",
        "Are meetings part of your daily work?"
      ],
      "Food & Drink": [
        "What is your favorite meal of the day?",
        "Is your lunch usually big or small?",
        "Are fruits part of your daily diet?",
        "Is your dinner at home or outside?",
        "Are you a coffee or tea drinker?",
        "Are you hungry in the morning?",
        "Is water your main drink?",
        "Is your cooking style simple or complex?",
        "Are you a fan of spicy food?",
        "Is breakfast important for you?"
      ],
      "Travel": [
        "Are you afraid of flying?",
        "Is traveling fun or stressful for you?",
        "Is your passport ready to use?",
        "Are airports exciting or boring?",
        "Are you interested in visiting new countries?",
        "Is your last trip still fresh in your memory?",
        "Are you planning a holiday this year?",
        "Is your favorite place near or far?",
        "Are road trips your style?",
        "Is traveling with friends better than alone?"
      ],
      "Technology": [
        "Is your phone always with you?",
        "Is technology important in your life?",
        "Is your computer new or old?",
        "Are you active on social media?",
        "Is Wi-Fi easy to find in your area?",
        "Is online shopping convenient for you?",
        "Is your internet fast or slow?",
        "Are you using apps every day?",
        "Is your phone battery good?",
        "Is screen time a problem for you?"
      ],
      "Shopping": [
        "Are you a careful shopper?",
        "Is shopping a fun activity for you?",
        "Are online stores better than physical ones?",
        "Are discounts important when you buy things?",
        "Is your favorite shop near your home?",
        "Are clothes shopping days exciting for you?",
        "Is it easy to find what you need?",
        "Are you using a shopping list?",
        "Is price more important than quality?",
        "Is weekend shopping part of your plan?"
      ],
      "Home": [
        "Is your home big or small?",
        "Are you happy with your neighborhood?",
        "Is your kitchen clean today?",
        "Is the TV in the living room?",
        "Are there plants in your house?",
        "Is your bed comfortable?",
        "Are your walls painted white or another color?",
        "Is your home quiet or noisy?",
        "Is your bathroom small?",
        "Is your desk in your room?"
      ]
    },
    "Have/has": {
      "Daily Routines": [
        "Do you have breakfast every morning?",
        "Do you have a regular bedtime?",
        "Do you have a routine for weekends?",
        "Do you have free time in the evening?",
        "Do you have lunch at home or outside?",
        "Do you have a morning workout?",
        "Do you have time to relax after work?",
        "Do you have a coffee every morning?",
        "Do you have time to read daily?",
        "Do you have a favorite part of the day?"
      ],
      "Work": [
        "Do you have a full-time job?",
        "Do you have meetings every week?",
        "Do you have a desk at your job?",
        "Do you have a lot of tasks at work?",
        "Do you have helpful coworkers?",
        "Do you have to wear a uniform?",
        "Do you have a short or long commute?",
        "Do you have flexible working hours?",
        "Do you have experience in your field?",
        "Do you have a manager or work alone?"
      ],
      "Food & Drink": [
        "Do you have a favorite restaurant?",
        "Do you have a sweet tooth?",
        "Do you have a regular grocery store?",
        "Do you have lunch at the same time daily?",
        "Do you have a special drink you like?",
        "Do you have a favorite type of food?",
        "Do you have snacks during the day?",
        "Do you have any food allergies?",
        "Do you have dessert after dinner?",
        "Do you have coffee after lunch?"
      ],
      "Travel": [
        "Do you have a valid passport?",
        "Do you have a favorite travel memory?",
        "Do you have a travel bucket list?",
        "Do you have a suitcase or a backpack?",
        "Do you have travel insurance when you go abroad?",
        "Do you have photos from your last trip?",
        "Do you have friends in other countries?",
        "Do you have travel apps on your phone?",
        "Do you have souvenirs from past holidays?",
        "Do you have a dream destination?"
      ],
      "Technology": [
        "Do you have a smartphone?",
        "Do you have a good internet connection?",
        "Do you have an email account?",
        "Do you have many apps on your phone?",
        "Do you have headphones or earbuds?",
        "Do you have a favorite website?",
        "Do you have social media accounts?",
        "Do you have a new or old laptop?",
        "Do you have a smart watch?",
        "Do you have any tech you want to buy?"
      ],
      "Shopping": [
        "Do you have a favorite shop?",
        "Do you have a shopping list?",
        "Do you have a budget for shopping?",
        "Do you have store loyalty cards?",
        "Do you have favorite brands?",
        "Do you have shopping days?",
        "Do you have many clothes?",
        "Do you have a favorite pair of shoes?",
        "Do you have any returns to make?",
        "Do you have an online shopping account?"
      ],
      "Home": [
        "Do you have your own room?",
        "Do you have a washing machine?",
        "Do you have photos on your walls?",
        "Do you have many pillows on your bed?",
        "Do you have a mirror in your bedroom?",
        "Do you have a bookshelf at home?",
        "Do you have a favorite spot in your home?",
        "Do you have a plant in your house?",
        "Do you have a balcony or garden?",
        "Do you have guests often?"
      ]
    },
    "There is / are": {
      "Daily Routines": [
        "Is there a time in your day when you relax?",
        "Is there a part of your routine you enjoy the most?",
        "Is there a place where you eat lunch every day?",
        "Are there any breaks during your workday?",
        "Is there a good time to do exercise in your routine?",
        "Is there always something new in your day?",
        "Are there any habits you want to change?",
        "Is there a moment you look forward to daily?",
        "Is there a lot of variety in your daily schedule?",
        "Are there any distractions in your morning routine?"
      ],
      "Work": [
        "Is there a meeting room in your office?",
        "Are there many people in your department?",
        "Is there a kitchen in your workplace?",
        "Are there any quiet places to work?",
        "Is there a dress code at your job?",
        "Are there any office rules you don’t like?",
        "Is there parking near your workplace?",
        "Are there snacks in the break room?",
        "Is there a clock in your office?",
        "Are there many tasks to do every day?"
      ],
      "Food & Drink": [
        "Is there a meal you eat every day?",
        "Are there fruits in your kitchen now?",
        "Is there a type of food you eat often?",
        "Are there drinks you always keep at home?",
        "Is there a dish you enjoy cooking?",
        "Is there food you never eat?",
        "Are there many restaurants near your home?",
        "Is there a food trend you follow?",
        "Are there snacks in your bag?",
        "Is there something you always order at a café?"
      ],
      "Travel": [
        "Is there a country you want to visit?",
        "Are there good places to relax in your city?",
        "Is there a trip you remember well?",
        "Are there places you avoid when traveling?",
        "Is there a beach or park near your house?",
        "Are there famous places in your country?",
        "Is there a way to travel cheaply?",
        "Are there cities you want to visit again?",
        "Is there public transport where you live?",
        "Are there museums or attractions you like?"
      ],
      "Technology": [
        "Is there Wi-Fi in every room of your home?",
        "Are there apps you use every day?",
        "Is there a charger near your bed?",
        "Are there too many emails in your inbox?",
        "Is there a new gadget you want to buy?",
        "Are there websites you visit daily?",
        "Is there a quiet place to work online?",
        "Are there tech tools you need for work?",
        "Is there a device you use most often?",
        "Are there any old phones in your house?"
      ],
      "Shopping": [
        "Is there a market near your home?",
        "Are there good deals in your area?",
        "Is there a mall you often visit?",
        "Are there many shops where you live?",
        "Is there a product you always buy?",
        "Are there long lines when you shop?",
        "Is there a shop assistant who helps you often?",
        "Are there sales this month?",
        "Is there a clothing brand you like?",
        "Are there places to return items easily?"
      ],
      "Home": [
        "Is there a mirror in your room?",
        "Are there chairs in your kitchen?",
        "Is there space for guests in your home?",
        "Are there decorations on your walls?",
        "Is there a quiet place in your house?",
        "Are there many lights in your home?",
        "Is there a TV in your bedroom?",
        "Are there bookshelves in your living room?",
        "Is there anything you want to change at home?",
        "Are there photos on your walls?"
      ]
    },
    "Can / Can’t": {
      "Daily Routines": [
        "Can you wake up without an alarm?",
        "Can you cook breakfast in 10 minutes?",
        "Can you go a day without using your phone?",
        "Can you sleep during the day?",
        "Can you focus early in the morning?",
        "Can you relax after a long workday?",
        "Can you exercise in the morning?",
        "Can you plan your day quickly?",
        "Can you do two tasks at once?",
        "Can you finish your routine before 9 a.m.?"
      ],
      "Work": [
        "Can you work under pressure?",
        "Can you speak in meetings confidently?",
        "Can you meet deadlines easily?",
        "Can you work from home effectively?",
        "Can you manage many tasks at once?",
        "Can you fix problems quickly?",
        "Can you give clear instructions?",
        "Can you train new coworkers?",
        "Can you lead a team?",
        "Can you use a photocopier or scanner?"
      ],
      "Food & Drink": [
        "Can you cook a full meal by yourself?",
        "Can you eat spicy food?",
        "Can you drink coffee at night?",
        "Can you follow a recipe easily?",
        "Can you eat without checking your phone?",
        "Can you tell if food is fresh?",
        "Can you make a dish from another country?",
        "Can you eat healthy every day?",
        "Can you shop for food quickly?",
        "Can you go a day without snacks?"
      ],
      "Travel": [
        "Can you read a map without help?",
        "Can you travel with just one bag?",
        "Can you sleep on planes or buses?",
        "Can you speak the local language?",
        "Can you find your gate at the airport alone?",
        "Can you book hotels online?",
        "Can you eat local food when traveling?",
        "Can you find your way in a new city?",
        "Can you travel without using GPS?",
        "Can you enjoy a long bus or train ride?"
      ],
      "Technology": [
        "Can you fix small tech problems yourself?",
        "Can you type quickly on a keyboard?",
        "Can you make video calls for work?",
        "Can you design something with an app?",
        "Can you live without your phone for a day?",
        "Can you organize files on your computer?",
        "Can you use smart home devices?",
        "Can you teach someone to use technology?",
        "Can you avoid checking your phone at night?",
        "Can you shop online without help?"
      ],
      "Shopping": [
        "Can you shop in less than 30 minutes?",
        "Can you compare prices before buying?",
        "Can you find discounts easily?",
        "Can you return things without a receipt?",
        "Can you shop without making a list?",
        "Can you resist buying things on sale?",
        "Can you shop for someone else?",
        "Can you carry heavy shopping bags?",
        "Can you pay with your phone?",
        "Can you remember what you need without writing it down?"
      ],
      "Home": [
        "Can you fix a light bulb?",
        "Can you clean your house in one hour?",
        "Can you find everything in your kitchen?",
        "Can you do your laundry alone?",
        "Can you live with a roommate?",
        "Can you keep your space organized?",
        "Can you move furniture by yourself?",
        "Can you use all the appliances in your home?",
        "Can you decorate your space creatively?",
        "Can you spend a whole day at home without getting bored?"
      ]
    },
    "Present Simple": {
      "Daily Routines": [
        "What time do you usually wake up?",
        "Do you drink coffee in the morning?",
        "How do you get to work or school?",
        "Do you check your phone before bed?",
        "What do you usually eat for breakfast?",
        "Do you exercise during the week?",
        "How do you relax in the evening?",
        "Do you go to bed at the same time every day?",
        "What is your weekend routine?",
        "Do you make your bed every day?"
      ],
      "Work": [
        "What do you do at work?",
        "Do you talk to your coworkers often?",
        "Do you take breaks during your workday?",
        "What time does your work start and finish?",
        "Do you work from home or go to the office?",
        "What tasks do you do every day?",
        "Do you check emails in the morning?",
        "Do you use a computer at work?",
        "What do you wear to work?",
        "Do you drink coffee at the office?"
      ],
      "Food & Drink": [
        "What do you usually eat for lunch?",
        "Do you cook dinner every night?",
        "Do you like sweet or salty snacks?",
        "What do you drink with your meals?",
        "Do you eat out often or cook at home?",
        "What fruits do you eat regularly?",
        "Do you drink a lot of water?",
        "Do you buy groceries on the weekend?",
        "What do you eat on special occasions?",
        "Do you eat the same breakfast every day?"
      ],
      "Travel": [
        "How do you usually travel to work?",
        "Do you take public transport often?",
        "Do you like to travel by plane?",
        "What do you pack for a short trip?",
        "Do you plan your trips in advance?",
        "Where do you usually go for holidays?",
        "Do you travel alone or with friends?",
        "Do you use a map or GPS?",
        "Do you stay in hotels or with family?",
        "Do you take many photos when you travel?"
      ],
      "Technology": [
        "Do you use social media every day?",
        "What apps do you use most often?",
        "Do you check your email in the morning?",
        "Do you use your phone during meals?",
        "What websites do you visit daily?",
        "Do you watch videos on your phone?",
        "Do you play games on your computer?",
        "Do you use your phone as an alarm clock?",
        "Do you back up your files?",
        "Do you shop online regularly?"
      ],
      "Shopping": [
        "Where do you usually buy your clothes?",
        "Do you shop online or in stores?",
        "Do you make a list before shopping?",
        "Do you compare prices before buying?",
        "What do you buy at the supermarket?",
        "Do you shop for groceries weekly?",
        "Do you buy gifts for friends often?",
        "Do you enjoy shopping?",
        "Do you use cash or card?",
        "Where do you buy your shoes?"
      ],
      "Home": [
        "Do you clean your house on weekends?",
        "What do you do to relax at home?",
        "Do you cook or order food at home?",
        "Do you invite friends to your home?",
        "Do you have a garden or balcony?",
        "Do you watch TV in the living room?",
        "Do you keep your home tidy?",
        "Do you listen to music at home?",
        "Do you work from home?",
        "Do you take naps during the day?"
      ]
    },
    "Prepositions of Place": {
      "Daily Routines": [
        "Where do you keep your phone in the morning?",
        "Is your alarm clock next to your bed?",
        "Where is your bag during the day?",
        "Is your coffee on your desk when you work?",
        "Where is your towel after you shower?",
        "Is your breakfast on the table or the counter?",
        "Where do you put your shoes before leaving?",
        "Is your planner in your bag or on your desk?",
        "Where do you leave your keys?",
        "Is your lunch in the fridge or on the table?"
      ],
      "Work": [
        "Where is your desk in the office?",
        "Is the printer near your workspace?",
        "Where do you keep your office supplies?",
        "Is the meeting room next to the kitchen?",
        "Where is your laptop during the day?",
        "Is your name tag on your desk?",
        "Where is the coffee machine in the office?",
        "Is your phone on the table or in your pocket?",
        "Where do you put your documents?",
        "Is your chair near the window?"
      ],
      "Food & Drink": [
        "Where is the milk in your fridge?",
        "Is the salt next to the pepper?",
        "Where do you keep your favorite snacks?",
        "Is your water bottle on the table or in your bag?",
        "Where is your coffee in the morning?",
        "Is the fruit on the counter or in the fridge?",
        "Where do you keep your utensils?",
        "Is the bread near the toaster?",
        "Where do you put your leftovers?",
        "Is the sugar above the sink or below it?"
      ],
      "Travel": [
        "Where is your passport before a trip?",
        "Is your suitcase under the bed or in the closet?",
        "Where do you keep your travel tickets?",
        "Is the map inside your bag or your pocket?",
        "Where is the hotel from the train station?",
        "Is your charger in your hand luggage?",
        "Where do you keep your travel documents?",
        "Is the airport far from your home?",
        "Where is the bus stop near your house?",
        "Is your ID card in your wallet or phone case?"
      ],
      "Technology": [
        "Where is your charger at home?",
        "Is your computer on the table or on your lap?",
        "Where do you keep your headphones?",
        "Is your phone next to your bed at night?",
        "Where is the router in your house?",
        "Is the remote on the sofa or the table?",
        "Where do you charge your devices?",
        "Is the tablet near your workspace?",
        "Where do you keep your old electronics?",
        "Is your camera inside a drawer or on display?"
      ],
      "Shopping": [
        "Where is your wallet when you go shopping?",
        "Is the supermarket near your home?",
        "Where is your shopping list — in your bag or on your phone?",
        "Is the market next to the train station?",
        "Where are the clothes in the store?",
        "Is the cashier in the front or back?",
        "Where do you put your purchases?",
        "Is the shoe section upstairs or downstairs?",
        "Where is your favorite brand in the store?",
        "Is the fitting room behind the counter?"
      ],
      "Home": [
        "Where is your bed in your room?",
        "Is the mirror above the sink?",
        "Where is the fridge in your kitchen?",
        "Is your sofa next to the window?",
        "Where do you keep your keys at home?",
        "Is the TV in front of the sofa?",
        "Where is your laundry basket?",
        "Is your desk near the bed?",
        "Where are the books in your house?",
        "Is the dining table close to the kitchen?"
      ]
    },
    "Imperatives": {
      "Daily Routines": [
        "Give someone advice for a good morning routine.",
        "Tell your friend how to prepare for work quickly.",
        "Give instructions for making breakfast.",
        "What do you say to yourself to start the day right?",
        "Tell someone how to relax after a long day.",
        "Give someone tips for a better night’s sleep.",
        "What do you say when someone is late in the morning?",
        "Tell someone how to stay focused during the day.",
        "Give someone advice to stay healthy during the week.",
        "Tell a new friend what not to do in the morning."
      ],
      "Work": [
        "Tell a new coworker how to use the coffee machine.",
        "Give instructions for starting a Zoom meeting.",
        "What do you say before a meeting starts?",
        "Tell someone how to organize their desk.",
        "Give a visitor directions to the meeting room.",
        "What do you say to a team that’s late?",
        "Tell someone how to print a document.",
        "Give advice to a new team member.",
        "Tell someone how to report a problem at work.",
        "Say something polite to end a work call."
      ],
      "Food & Drink": [
        "Tell someone how to make tea.",
        "Give instructions for setting the table.",
        "What do you say when someone eats too fast?",
        "Tell someone how to order food online.",
        "Give instructions for cooking rice.",
        "What do you say when someone forgets to eat?",
        "Tell a friend how to clean the kitchen.",
        "Give advice about healthy eating.",
        "Tell someone how to pack lunch for work.",
        "Say something to a friend who is drinking too much coffee."
      ],
      "Travel": [
        "Tell someone how to pack for a short trip.",
        "Give instructions for getting through the airport.",
        "What do you say when someone is late for a flight?",
        "Tell someone how to book a hotel online.",
        "Give a friend advice for safe travel.",
        "What do you say when someone forgets their passport?",
        "Tell someone how to use public transport in your city.",
        "Give instructions for checking into a hotel.",
        "Tell a tourist how to get to your house.",
        "Say something to a friend before they take a trip."
      ],
      "Technology": [
        "Tell someone how to log in to the computer.",
        "Give instructions for sending an email.",
        "What do you say when someone’s mic isn’t working?",
        "Tell someone how to reset a password.",
        "Give advice for online safety.",
        "Tell a coworker how to join a Zoom call.",
        "What do you say when someone forgets to save a file?",
        "Tell someone how to update an app.",
        "Give advice on protecting your phone.",
        "Say something to a friend who lost internet connection."
      ],
      "Shopping": [
        "Tell a friend how to find discounts online.",
        "Give instructions for using a self-checkout machine.",
        "What do you say when someone spends too much?",
        "Tell someone how to return an item.",
        "Give shopping advice for saving money.",
        "Tell someone how to use a loyalty card.",
        "What do you say when someone forgets their wallet?",
        "Give advice about buying groceries.",
        "Tell someone how to find a specific brand.",
        "Say something to someone who shops too often."
      ],
      "Home": [
        "Tell someone how to clean the bathroom.",
        "Give instructions for doing laundry.",
        "What do you say when someone makes a mess?",
        "Tell a guest how to connect to your Wi-Fi.",
        "Give advice for organizing the kitchen.",
        "Tell someone how to water the plants.",
        "Give instructions for using the microwave.",
        "What do you say when someone enters your home?",
        "Tell someone how to take out the trash.",
        "Say something to a noisy neighbor."
      ]
    },
    "Wh- questions": {
      "Daily Routines": [
        "What do you usually do after waking up?",
        "When do you eat breakfast on weekdays?",
        "Where do you usually go after work?",
        "Who helps you with your routine?",
        "What time do you go to bed?",
        "When do you take breaks during the day?",
        "What do you do on Sunday mornings?",
        "Where do you keep your work bag?",
        "Who do you talk to in the morning?",
        "When do you check your messages?"
      ],
      "Work": [
        "What do you do at your job?",
        "Who do you work with every day?",
        "Where do you eat lunch during work?",
        "When do you usually start working?",
        "What tasks do you enjoy doing at work?",
        "Who do you report to at work?",
        "Where is your office or workplace?",
        "When do you take your coffee break?",
        "What do you use a computer for at work?",
        "Who joins your team meetings?"
      ],
      "Food & Drink": [
        "What do you usually eat for dinner?",
        "Where do you buy your groceries?",
        "Who cooks in your house?",
        "When do you eat your main meal?",
        "What’s your favorite dish to cook?",
        "Where do you go for coffee?",
        "When do you usually eat out?",
        "Who do you usually eat with?",
        "What snacks do you enjoy?",
        "Where do you keep your drinks at home?"
      ],
      "Travel": [
        "Where do you want to travel next?",
        "Who do you travel with the most?",
        "What do you pack first when traveling?",
        "When is the best time to travel?",
        "Where do you stay when you go abroad?",
        "Who plans the trips in your family?",
        "What do you like about traveling?",
        "When do you usually take holidays?",
        "What cities have you visited?",
        "Where do you buy your tickets?"
      ],
      "Technology": [
        "What apps do you use daily?",
        "Where do you keep your phone at night?",
        "Who helps you with tech problems?",
        "When do you use your computer?",
        "What websites do you visit often?",
        "Who do you call the most?",
        "When do you check your email?",
        "What do you use your phone for?",
        "Where is your Wi-Fi router?",
        "What tech item do you want to buy?"
      ],
      "Shopping": [
        "Where do you shop for clothes?",
        "What do you buy every week?",
        "Who do you usually shop with?",
        "When do you like to go shopping?",
        "Where can you find good deals?",
        "What’s your favorite store?",
        "Who gives you shopping advice?",
        "What items do you often forget to buy?",
        "Where do you return items?",
        "When do stores usually open?"
      ],
      "Home": [
        "Where do you live?",
        "Who do you live with?",
        "What furniture do you have in your room?",
        "When do you usually clean your house?",
        "Where do you eat at home?",
        "Who visits your home often?",
        "What’s your favorite room?",
        "When do you do your laundry?",
        "Where do you keep your shoes?",
        "Who does the cooking at home?"
      ]
    },
    "Simple Plurals": {
      "Daily Routines": [
        "What things do you always carry in your bag?",
        "What clothes do you wear in the morning?",
        "What activities are part of your daily routine?",
        "What chores do you do after work?",
        "What meals do you usually eat each day?",
        "What tools do you use in the morning?",
        "What apps do you check when you wake up?",
        "What snacks do you eat during the day?",
        "What shoes do you wear most often?",
        "What tasks are easy for you in the morning?"
      ],
      "Work": [
        "What tasks do you do every day at work?",
        "What tools do you need for your job?",
        "What things are on your desk?",
        "What meetings do you attend regularly?",
        "What documents do you often print?",
        "What problems do you solve at work?",
        "What emails do you reply to first?",
        "What breaks do you take during the day?",
        "What jobs are common in your office?",
        "What coworkers do you talk to the most?"
      ],
      "Food & Drink": [
        "What fruits do you eat every week?",
        "What drinks do you like at breakfast?",
        "What vegetables do you cook at home?",
        "What meals do you enjoy the most?",
        "What snacks do you keep at your desk?",
        "What spices do you use in your cooking?",
        "What groceries do you buy every weekend?",
        "What desserts do you like to eat?",
        "What foods are always in your kitchen?",
        "What dishes do you cook for guests?"
      ],
      "Travel": [
        "What countries do you want to visit?",
        "What clothes do you pack for a trip?",
        "What items do you carry in your suitcase?",
        "What cities have you traveled to?",
        "What photos do you take when traveling?",
        "What apps do you use for travel?",
        "What hotels do you like to stay in?",
        "What souvenirs do you buy?",
        "What documents do you need for flying?",
        "What bags do you take on a weekend trip?"
      ],
      "Technology": [
        "What devices do you use every day?",
        "What apps do you open in the morning?",
        "What websites do you visit most often?",
        "What problems do you have with your phone?",
        "What tools do you use for work online?",
        "What emails do you check first?",
        "What files do you save to your computer?",
        "What messages do you reply to quickly?",
        "What games do you play on your phone?",
        "What passwords do you use often?"
      ],
      "Shopping": [
        "What items do you buy every month?",
        "What products do you check online before buying?",
        "What stores do you visit regularly?",
        "What shoes do you like to shop for?",
        "What brands do you usually choose?",
        "What gifts do you buy for family?",
        "What clothes do you buy in winter?",
        "What groceries do you get at the supermarket?",
        "What discounts do you look for?",
        "What things do you always forget to buy?"
      ],
      "Home": [
        "What rooms are in your home?",
        "What chairs do you have at your dining table?",
        "What colors are your bedroom walls?",
        "What things are on your kitchen counter?",
        "What appliances do you use every day?",
        "What lights are on in your home now?",
        "What books are on your shelf?",
        "What photos are on your walls?",
        "What tasks do you do on the weekend at home?",
        "What windows in your house are open often?"
      ]
    }
  }
}