{
  "A2": {
    "Past Simple": {
      "Daily Life": [
        "What time did you wake up yesterday?",
        "Did you cook or eat out last night?",
        "What did you do last weekend?",
        "Did you meet anyone new recently?",
        "How did you spend your last public holiday?",
        "Did you clean your house last week?",
        "What did you wear yesterday?",
        "Did you go grocery shopping last weekend?",
        "What was the best part of your day yesterday?",
        "Did you use public transport last week?"
      ],
      "Food & Drink": [
        "What did you eat for dinner last night?",
        "Did you try any new food recently?",
        "What was the last restaurant you went to?",
        "Did you cook anything last weekend?",
        "What was your favorite meal as a child?",
        "Did you drink coffee this morning?",
        "What snacks did you have last week?",
        "Did you eat breakfast today?",
        "What dessert did you have last?",
        "Did you try any traditional food recently?"
      ],
      "Travel": [
        "Where did you go on your last holiday?",
        "Did you take any photos during your last trip?",
        "What transport did you use on your last vacation?",
        "Did you travel with friends or family?",
        "What places did you visit last year?",
        "Did you stay in a hotel or Airbnb?",
        "What did you like most about your last trip?",
        "Did you buy any souvenirs?",
        "Was your last trip relaxing or exciting?",
        "Did anything funny happen during your trip?"
      ],
      "Work & School": [
        "Did you have any meetings last week?",
        "What was the last project you worked on?",
        "Did you study for anything recently?",
        "What subject did you enjoy in school?",
        "Did you work overtime last month?",
        "Who did you talk to at work yesterday?",
        "Did you use English at work last week?",
        "What was your first job?",
        "Did you take any tests in school?",
        "What did you wear to school or work yesterday?"
      ],
      "Technology": [
        "Did you use your phone a lot yesterday?",
        "What was the last app you downloaded?",
        "Did you watch any videos online last night?",
        "What device did you use most last weekend?",
        "Did you play any games recently?",
        "What was the last website you visited?",
        "Did your internet work well yesterday?",
        "Did you charge your phone overnight?",
        "What tech problem did you have recently?",
        "Did you send any emails today?"
      ],
      "Hobbies & Free Time": [
        "What did you do for fun last weekend?",
        "Did you watch a movie recently?",
        "Did you listen to any music yesterday?",
        "What was the last book you read?",
        "Did you hang out with any friends recently?",
        "What games did you play last week?",
        "Did you try a new hobby this year?",
        "What did you do after work yesterday?",
        "Did you relax at home last Sunday?",
        "What fun activity did you enjoy last month?"
      ],
      "Health & Fitness": [
        "Did you exercise last week?",
        "What healthy food did you eat yesterday?",
        "Did you visit the doctor recently?",
        "How did you feel last weekend?",
        "Did you go for a walk yesterday?",
        "What time did you go to bed last night?",
        "Did you drink enough water yesterday?",
        "Did you stretch before exercising?",
        "What was your last workout?",
        "Did you have a headache last week?"
      ]
    },
    "Future (going to)": {
      "Daily Life": [
        "What are you going to do after this class?",
        "Are you going to clean your room this weekend?",
        "Who are you going to meet tomorrow?",
        "Are you going to watch TV tonight?",
        "What are you going to wear tomorrow?",
        "Are you going to take the bus or train later?",
        "Are you going to cook tonight or order food?",
        "What time are you going to wake up tomorrow?",
        "Are you going to study or relax tonight?",
        "What are you going to do this Saturday?"
      ],
      "Food & Drink": [
        "Are you going to eat out this weekend?",
        "What are you going to cook for dinner?",
        "Are you going to try a new recipe soon?",
        "What are you going to have for breakfast tomorrow?",
        "Are you going to buy any snacks later?",
        "Are you going to drink coffee or tea in the morning?",
        "Are you going to go grocery shopping soon?",
        "What are you going to eat on your next birthday?",
        "Are you going to try any new restaurants?",
        "What are you going to bring to a potluck?"
      ],
      "Travel": [
        "Are you going to travel this year?",
        "Where are you going to go on your next holiday?",
        "Are you going to fly or take a train?",
        "Who are you going to travel with?",
        "Are you going to book a hotel or Airbnb?",
        "What places are you going to visit next?",
        "Are you going to take a lot of photos?",
        "What are you going to pack for your trip?",
        "Are you going to try local food while traveling?",
        "When are you going to go on your next trip?"
      ],
      "Work & School": [
        "Are you going to work this weekend?",
        "What are you going to study next?",
        "Are you going to have any meetings tomorrow?",
        "Are you going to finish your assignment soon?",
        "Are you going to learn anything new this month?",
        "What are you going to wear to work tomorrow?",
        "Are you going to speak English at work today?",
        "Are you going to join any school events?",
        "Who are you going to work with next week?",
        "Are you going to get a new job this year?"
      ],
      "Technology": [
        "Are you going to buy a new phone soon?",
        "What app are you going to use later?",
        "Are you going to play video games tonight?",
        "Are you going to check your email after this?",
        "Are you going to watch videos online later?",
        "Are you going to update your computer soon?",
        "What are you going to search for online?",
        "Are you going to use social media today?",
        "Are you going to print anything this week?",
        "Are you going to try a new tech gadget soon?"
      ],
      "Hobbies & Free Time": [
        "Are you going to read a book this weekend?",
        "What movie are you going to watch next?",
        "Are you going to start a new hobby soon?",
        "Are you going to play any sports this week?",
        "Who are you going to hang out with this weekend?",
        "Are you going to visit any friends soon?",
        "What game are you going to play later?",
        "Are you going to go to the cinema this month?",
        "Are you going to join a club or group activity?",
        "What are you going to do for fun tomorrow?"
      ],
      "Health & Fitness": [
        "Are you going to exercise tomorrow?",
        "What healthy food are you going to eat this week?",
        "Are you going to drink more water today?",
        "Are you going to sleep early tonight?",
        "Are you going to walk or drive tomorrow?",
        "What sport are you going to try soon?",
        "Are you going to go to the gym this weekend?",
        "Are you going to take a break today?",
        "Are you going to see a doctor this month?",
        "Are you going to take any vitamins or medicine?"
      ]
    },
    "Present Continuous": {
      "Daily Life": [
        "What are you doing right now?",
        "Are you studying English this week?",
        "Who are you talking to these days?",
        "Are you reading any books at the moment?",
        "What chores are you doing today?",
        "Are you using your phone a lot lately?",
        "What are your friends doing this weekend?",
        "Are you planning anything fun today?",
        "Are you staying at home tonight?",
        "What are your classmates doing today?"
      ],
      "Food & Drink": [
        "Are you eating healthy these days?",
        "What are you cooking for dinner tonight?",
        "Are you trying any new recipes?",
        "Are you drinking enough water today?",
        "What snacks are you eating recently?",
        "Are you avoiding any food this month?",
        "Are you having lunch at home or outside?",
        "What food are you thinking about now?",
        "Are you eating more fruits this week?",
        "What drinks are you having at the moment?"
      ],
      "Travel": [
        "Are you planning a trip right now?",
        "Where are you going for your next holiday?",
        "Are you booking a hotel this week?",
        "Are you packing your bags today?",
        "Are you saving money for travel?",
        "Are you talking to a travel agent?",
        "What places are you thinking of visiting?",
        "Are you checking flights today?",
        "Are you buying a new suitcase?",
        "Who are you traveling with next?"
      ],
      "Work & School": [
        "What project are you working on now?",
        "Are you learning anything new this month?",
        "Are you preparing for a test?",
        "Are you helping your coworkers this week?",
        "What tasks are you doing today?",
        "Are you writing a report now?",
        "Are you meeting your teacher today?",
        "Who are you studying with these days?",
        "Are you checking your email now?",
        "What are you working on in class?"
      ],
      "Technology": [
        "Are you using any new apps?",
        "What games are you playing these days?",
        "Are you downloading anything now?",
        "Are you chatting with anyone online?",
        "What tech are you using right now?",
        "Are you watching videos online?",
        "Are you fixing your computer?",
        "Are you learning anything tech-related?",
        "What software are you using at work?",
        "Are you using social media a lot now?"
      ],
      "Hobbies & Free Time": [
        "Are you watching any TV shows now?",
        "What book are you reading these days?",
        "Are you playing any sports this week?",
        "Are you learning to play an instrument?",
        "What games are you playing recently?",
        "Are you joining any hobby groups?",
        "What fun things are you doing today?",
        "Are you practicing any hobbies at home?",
        "Are you drawing or painting anything now?",
        "Who are you spending your free time with?"
      ],
      "Health & Fitness": [
        "Are you exercising regularly this month?",
        "Are you going to the gym today?",
        "What healthy habits are you building now?",
        "Are you drinking more water lately?",
        "Are you feeling tired today?",
        "Are you sleeping well these days?",
        "Are you walking or biking to work?",
        "What healthy food are you eating now?",
        "Are you trying a new fitness routine?",
        "Are you taking care of your health?"
      ]
    },
    "Countable / Uncountable Nouns": {
      "Daily Life": [
        "How much time do you spend watching TV?",
        "Do you have any chairs in your bedroom?",
        "How many bags do you carry to work?",
        "Is there any milk in your fridge?",
        "Do you have a lot of furniture at home?",
        "How many cups of coffee do you drink a day?",
        "Do you need any help with your chores?",
        "Are there many people in your neighborhood?",
        "Do you use much sugar in your tea or coffee?",
        "How many lights are in your house?"
      ],
      "Food & Drink": [
        "How much water do you drink every day?",
        "Do you eat a lot of rice?",
        "How many eggs do you buy every week?",
        "Is there any bread left in the kitchen?",
        "How much juice do you usually drink?",
        "Do you need any tomatoes for the recipe?",
        "How many bottles of water are in your fridge?",
        "Do you eat much meat or fish?",
        "How much salt do you use when cooking?",
        "Are there any vegetables you don’t like?"
      ],
      "Travel": [
        "How much luggage do you take on trips?",
        "Do you carry many clothes when you travel?",
        "Is there any space left in your suitcase?",
        "How many cities have you visited?",
        "Do you pack much food for travel?",
        "Are there many tourists in your city?",
        "Do you take many photos when you travel?",
        "Is there any money left from your last trip?",
        "How much time do you spend traveling each year?",
        "Do you bring many souvenirs home?"
      ],
      "Work & School": [
        "How many pens do you keep at your desk?",
        "Do you bring much work home?",
        "Is there any paper in the printer?",
        "How much homework do you usually have?",
        "Are there many students in your class?",
        "Do you use much technology at work?",
        "How many notebooks do you have?",
        "Do you need any help with your assignments?",
        "Is there much noise in your classroom?",
        "How many files do you have on your computer?"
      ],
      "Technology": [
        "How much data do you use on your phone?",
        "Are there many apps on your phone?",
        "Do you have any cables for charging?",
        "How many emails do you send every day?",
        "Is there any memory left on your laptop?",
        "Do you download much music or video?",
        "How many photos are on your phone?",
        "Is there any battery left on your device?",
        "Do you buy many tech gadgets?",
        "How much screen time do you get daily?"
      ],
      "Hobbies & Free Time": [
        "How much time do you spend on hobbies?",
        "Do you own many books?",
        "Is there any equipment you need for your hobby?",
        "How many games do you have at home?",
        "Do you use much paper for drawing or writing?",
        "Are there many songs in your playlist?",
        "Do you need any tools for your hobby?",
        "How many hours do you spend relaxing?",
        "Is there much noise when you do your hobby?",
        "Do you have any free time today?"
      ],
      "Health & Fitness": [
        "How much water do you drink during exercise?",
        "Do you take many vitamins?",
        "Is there any fruit in your diet?",
        "How many steps do you take each day?",
        "Do you eat much sugar?",
        "Are there many gyms near your house?",
        "Do you use any equipment when you work out?",
        "How much sleep do you get each night?",
        "Is there any stress in your life now?",
        "Do you eat many snacks during the day?"
      ]
    },
    "Comparative / Superlative": {
      "Daily Life": [
        "Is your morning routine longer or shorter than others?",
        "Who is the busiest person in your family?",
        "Is your home cleaner now than last week?",
        "What is the most relaxing part of your day?",
        "Do you think weekends are better than weekdays?",
        "What’s the most difficult chore at home?",
        "Is your life busier this year than last year?",
        "Who is the loudest person in your house?",
        "Is your neighborhood quieter than others?",
        "What’s the easiest task you do every day?"
      ],
      "Food & Drink": [
        "What is the most delicious food you know?",
        "Is coffee better than tea for you?",
        "What is the healthiest meal you eat?",
        "Which is more filling: rice or noodles?",
        "What’s the best restaurant in your area?",
        "Is fast food cheaper than homemade food?",
        "What’s the spiciest food you’ve tried?",
        "Do you like sweet food more than salty food?",
        "What’s the most expensive food you've eaten?",
        "Which fruit is tastier: mango or banana?"
      ],
      "Travel": [
        "What is the most beautiful place you’ve visited?",
        "Do you prefer traveling by train or by plane?",
        "What’s the longest trip you’ve taken?",
        "Is summer travel easier than winter travel?",
        "What’s the best country you’ve visited?",
        "Is the beach more relaxing than the mountains?",
        "What’s the worst hotel you’ve stayed in?",
        "What city is more interesting than your own?",
        "Is traveling alone better than with friends?",
        "What’s the most exciting activity you did on holiday?"
      ],
      "Work & School": [
        "Who is the most helpful person at your work or school?",
        "Is math easier or harder than science for you?",
        "What is the most useful subject in school?",
        "Are group projects better than working alone?",
        "What’s the most boring task you do?",
        "Is your job more difficult than your last one?",
        "What’s the longest meeting you’ve had?",
        "Which is more fun: learning online or in class?",
        "What’s the best advice you received at work or school?",
        "Who is the smartest person you know?"
      ],
      "Technology": [
        "Is your phone newer than your computer?",
        "What is the most useful app you have?",
        "Is texting faster than calling?",
        "Which is better: a laptop or a tablet?",
        "What’s the most expensive gadget you own?",
        "Is online shopping easier than shopping in stores?",
        "What’s the most popular app among your friends?",
        "Which is more important: battery life or camera quality?",
        "Is your current phone better than your old one?",
        "What’s the fastest website you use?"
      ],
      "Hobbies & Free Time": [
        "What is the most fun hobby you’ve tried?",
        "Is reading more relaxing than watching TV?",
        "Which is harder: painting or writing?",
        "What’s the best game you’ve played recently?",
        "Is music more important to you than movies?",
        "What’s the most difficult skill you’ve learned?",
        "Which is better for weekends: going out or staying in?",
        "What’s the most exciting thing you’ve done lately?",
        "Are indoor hobbies better than outdoor ones?",
        "What’s the funniest movie you’ve ever watched?"
      ],
      "Health & Fitness": [
        "What is the healthiest habit you have?",
        "Is walking better than running for you?",
        "What’s the most difficult exercise you’ve done?",
        "Is sleeping more important than eating well?",
        "What’s the coldest place you’ve worked out in?",
        "Is yoga more relaxing than gym workouts?",
        "Who is the fittest person you know?",
        "What’s the best way to reduce stress?",
        "Is drinking water more helpful than taking vitamins?",
        "What’s the most tiring thing you did this week?"
      ]
    },
    "Modals (can, must, should)": {
      "Daily Life": [
        "What chores must you do every day?",
        "Can you wake up without an alarm?",
        "What should you do before you leave home?",
        "Can you cook your own meals?",
        "What must you remember to take when you go out?",
        "Should people work on the weekend?",
        "Can you do more than one task at a time?",
        "What should you do when you feel tired?",
        "Must you check your phone often?",
        "What should people avoid doing in the morning?"
      ],
      "Food & Drink": [
        "What food should you eat more of?",
        "Can you cook well?",
        "What must you avoid if you want to be healthy?",
        "Should people eat fast food often?",
        "What drinks should people have in the morning?",
        "Can you eat spicy food?",
        "What should you buy if you're hosting a dinner?",
        "Must you follow recipes exactly?",
        "What food can you make in 10 minutes?",
        "Should people try food from other countries?"
      ],
      "Travel": [
        "What must you take on every trip?",
        "Should people travel alone?",
        "Can you sleep on a plane?",
        "What must you do before going to the airport?",
        "Should travelers learn basic local phrases?",
        "Can you travel without using maps or GPS?",
        "Must you check your passport often while abroad?",
        "Should people plan everything before a trip?",
        "Can you carry only a backpack for long travel?",
        "What places should tourists visit in your country?"
      ],
      "Work & School": [
        "What should you do before a big meeting?",
        "Can you focus for a long time?",
        "Must students always do homework?",
        "What must employees do every day?",
        "Should coworkers be friends?",
        "Can you work under pressure?",
        "What should you do if you're late for work?",
        "Must teachers give homework every day?",
        "Can you eat lunch at your desk?",
        "Should people take breaks often?"
      ],
      "Technology": [
        "Can you live without your phone?",
        "Should people spend less time online?",
        "Must you update your software often?",
        "Can you fix small tech problems yourself?",
        "Should kids use tablets at school?",
        "What apps should people delete?",
        "Must you remember passwords for every site?",
        "Should you check your email on weekends?",
        "Can you learn a new tech skill easily?",
        "What should people do during screen breaks?"
      ],
      "Hobbies & Free Time": [
        "What hobbies should people try once?",
        "Can you play a musical instrument?",
        "Must you practice every day to improve?",
        "Should you try new hobbies often?",
        "Can you enjoy a hobby without being good at it?",
        "What should people do in their free time?",
        "Should everyone have a creative hobby?",
        "Must you spend money to enjoy hobbies?",
        "Can you learn hobbies from YouTube?",
        "What should people avoid doing in their free time?"
      ],
      "Health & Fitness": [
        "What should people do to stay healthy?",
        "Can you exercise every day?",
        "Must you see a doctor every year?",
        "Should people go for walks after meals?",
        "Can you sleep more than 8 hours a night?",
        "What food should people eat less of?",
        "Should you drink water before or after exercise?",
        "Must people stretch before working out?",
        "Can you stay fit without going to a gym?",
        "What health rules must you follow daily?"
      ]
    },
    "Adverbs of Frequency": {
      "Daily Life": [
        "How often do you wake up early?",
        "Do you always eat breakfast?",
        "How often do you go grocery shopping?",
        "Do you sometimes forget your keys?",
        "How often do you check your phone in the morning?",
        "Do you usually clean your room?",
        "How often do you take public transport?",
        "Do you ever stay up very late?",
        "How often do you make your bed?",
        "Do you rarely watch the news?"
      ],
      "Food & Drink": [
        "How often do you eat out?",
        "Do you always drink water with meals?",
        "How often do you eat vegetables?",
        "Do you usually cook at home or eat outside?",
        "Do you ever skip lunch?",
        "How often do you eat snacks between meals?",
        "Do you sometimes try new food?",
        "How often do you drink coffee?",
        "Do you rarely eat dessert?",
        "Do you often have fruit for breakfast?"
      ],
      "Travel": [
        "How often do you travel abroad?",
        "Do you usually travel alone or with friends?",
        "How often do you take short trips?",
        "Do you ever get lost when you travel?",
        "Do you always pack early for your trip?",
        "How often do you visit new cities?",
        "Do you sometimes forget things when packing?",
        "Do you usually stay in hotels or hostels?",
        "How often do you take photos when traveling?",
        "Do you rarely use maps when exploring?"
      ],
      "Work & School": [
        "How often do you check your email?",
        "Do you always arrive on time?",
        "How often do you do homework or projects?",
        "Do you sometimes forget deadlines?",
        "Do you usually eat lunch at work or school?",
        "How often do you work on weekends?",
        "Do you ever study with friends?",
        "How often do you ask questions in class?",
        "Do you often take breaks while working?",
        "Do you rarely miss a class or meeting?"
      ],
      "Technology": [
        "How often do you use your phone?",
        "Do you always charge your devices at night?",
        "How often do you check social media?",
        "Do you sometimes forget your passwords?",
        "Do you usually update your apps?",
        "How often do you use video calls?",
        "Do you ever take a break from screens?",
        "Do you often shop online?",
        "How often do you use a computer?",
        "Do you rarely read the news online?"
      ],
      "Hobbies & Free Time": [
        "How often do you watch movies?",
        "Do you usually read books or magazines?",
        "How often do you hang out with friends?",
        "Do you always play the same games?",
        "Do you sometimes draw or paint?",
        "How often do you go for a walk?",
        "Do you ever go to museums or galleries?",
        "Do you usually listen to music every day?",
        "How often do you try new hobbies?",
        "Do you rarely stay home on weekends?"
      ],
      "Health & Fitness": [
        "How often do you exercise?",
        "Do you always stretch before working out?",
        "How often do you eat healthy meals?",
        "Do you sometimes skip breakfast?",
        "Do you usually sleep 7–8 hours a night?",
        "How often do you go for medical checkups?",
        "Do you ever take vitamins?",
        "How often do you drink water?",
        "Do you usually walk or bike instead of driving?",
        "Do you rarely feel tired in the morning?"
      ]
    },
    "Present Simple": {
      "Daily Life": [
        "What time do you usually wake up?",
        "Do you make your bed every morning?",
        "What do you do after you get home?",
        "Do you cook your own meals?",
        "What do you do on weekends?",
        "Do you go to bed early or late?",
        "Do you use public transport or drive?",
        "What does your typical weekday look like?",
        "Do you clean your house often?",
        "How do you start your day?"
      ],
      "Food & Drink": [
        "Do you eat breakfast every day?",
        "What do you usually eat for lunch?",
        "Do you drink tea or coffee in the morning?",
        "Where do you buy groceries?",
        "Do you cook dinner at home or eat out?",
        "What snacks do you often eat?",
        "Do you eat fruit every day?",
        "What food do you like the most?",
        "Do you drink enough water daily?",
        "What do you usually have for dessert?"
      ],
      "Travel": [
        "Do you travel often?",
        "How do you usually get around your city?",
        "Do you prefer buses or trains?",
        "Where do you go on weekends?",
        "Do you take trips with your family?",
        "What city do you want to visit?",
        "Do you travel for work or fun?",
        "How often do you go to the beach?",
        "Do you book your trips online?",
        "What do you usually pack for a short trip?"
      ],
      "Work & School": [
        "Do you work or study?",
        "What do you usually do at work?",
        "Do you enjoy your job or classes?",
        "When do your classes or work start?",
        "Do you take notes during meetings or lectures?",
        "Do you talk to your coworkers or classmates often?",
        "What time do you usually finish work or school?",
        "Do you do your homework or tasks on time?",
        "Do you use English at work or school?",
        "Do you eat lunch with colleagues or alone?"
      ],
      "Technology": [
        "Do you use your phone a lot?",
        "What apps do you use daily?",
        "Do you watch videos online?",
        "Do you play games on your phone?",
        "How often do you check your email?",
        "What websites do you visit every day?",
        "Do you use your computer for work or fun?",
        "Do you listen to music online?",
        "Do you follow any tech news?",
        "What do you usually do online?"
      ],
      "Hobbies & Free Time": [
        "What do you do in your free time?",
        "Do you watch TV or movies?",
        "Do you read books or magazines?",
        "What music do you like?",
        "Do you go out with friends often?",
        "Do you play any sports or games?",
        "Do you have any creative hobbies?",
        "How do you relax after work or school?",
        "Do you take classes for fun?",
        "Do you enjoy spending time alone or with others?"
      ],
      "Health & Fitness": [
        "Do you exercise regularly?",
        "What sports do you play?",
        "Do you go to the gym?",
        "What do you eat to stay healthy?",
        "Do you drink water or juice more often?",
        "How much sleep do you get every night?",
        "Do you go for walks or runs?",
        "What time do you go to bed?",
        "Do you do any home workouts?",
        "How do you stay healthy every day?"
      ]
    },
    "Prepositions of Place": {
      "Daily Life": [
        "Where is your phone right now?",
        "What is under your bed at home?",
        "Is there a clock on the wall in your room?",
        "Where do you usually keep your keys?",
        "What is next to your bed?",
        "Is there a mirror in your bathroom?",
        "What’s in front of your house?",
        "Where do you keep your shoes?",
        "What is behind your door?",
        "Do you have a chair near your window?"
      ],
      "Food & Drink": [
        "Where is the fridge in your kitchen?",
        "Do you keep fruit on the table?",
        "Is there sugar in the cupboard?",
        "Where is the nearest supermarket?",
        "What is next to your stove?",
        "Where do you keep your snacks?",
        "Is there a bottle of water in your bag?",
        "What is inside your lunchbox?",
        "Do you have any food in the car?",
        "Where is the best place to eat near your house?"
      ],
      "Travel": [
        "Where is your passport right now?",
        "What’s under the seat on a plane?",
        "Is your hotel near the city center?",
        "Where is your favorite place to sit on a train?",
        "What is next to the airport?",
        "Where do you keep your luggage during a trip?",
        "Is there a map in your bag?",
        "Where do you put your ticket when you travel?",
        "What’s above the bed in a hotel room?",
        "Where is the best café near the station?"
      ],
      "Work & School": [
        "What is on your desk at work or school?",
        "Is there a clock above the board?",
        "Where is the nearest printer?",
        "What do you keep under your desk?",
        "Where do you put your school books?",
        "Is there a water cooler near your office?",
        "Where is your boss's office?",
        "What is next to the classroom?",
        "Do you sit near the window in class?",
        "What’s in the drawer at your desk?"
      ],
      "Technology": [
        "Where is your laptop right now?",
        "Do you keep your charger on the table?",
        "What’s next to your computer?",
        "Is your router near the TV?",
        "Where do you keep your headphones?",
        "Is your phone on the charger?",
        "Where is your keyboard when you're not using it?",
        "What’s in your tech bag?",
        "Do you leave your devices near your bed?",
        "What’s on your desktop background?"
      ],
      "Hobbies & Free Time": [
        "Where do you do your hobbies?",
        "Is your guitar next to the sofa?",
        "What’s on your bookshelf?",
        "Where do you keep your art supplies?",
        "Do you have board games under the bed?",
        "Where is your favorite place to relax at home?",
        "What is near your TV?",
        "Where do you sit when you watch movies?",
        "Is your sports equipment in the garage?",
        "What’s inside your hobby box or bag?"
      ],
      "Health & Fitness": [
        "Where is your gym bag right now?",
        "Do you keep your running shoes near the door?",
        "What’s next to the yoga mat?",
        "Where do you put your water bottle at the gym?",
        "Is your towel in your backpack?",
        "Where do you do home workouts?",
        "What is under your workout bench?",
        "Is your health book in your bag?",
        "Where is your medicine kept?",
        "What’s inside your fitness drawer or shelf?"
      ]
    },
    "Imperatives": {
      "Daily Life": [
        "Tell someone how to make a cup of tea.",
        "Give instructions for waking up early.",
        "Tell your friend how to get to your house.",
        "Give advice to someone starting a new day.",
        "Tell someone how to tidy their room quickly.",
        "Give steps to prepare for work or school.",
        "Tell someone how to relax after a long day.",
        "Give tips for organizing your daily schedule.",
        "Tell a visitor how to enter your apartment.",
        "Give instructions for locking the door before leaving."
      ],
      "Food & Drink": [
        "Tell someone how to make your favorite sandwich.",
        "Give steps to cook a simple dinner.",
        "Tell a friend how to make good coffee.",
        "Give advice for eating healthy.",
        "Tell someone how to set the table.",
        "Give instructions for washing vegetables.",
        "Tell a child how to pack a lunchbox.",
        "Give tips for choosing fresh fruit.",
        "Tell someone how to order food at a restaurant.",
        "Give directions to make instant noodles."
      ],
      "Travel": [
        "Tell a tourist how to use the MRT or subway.",
        "Give instructions for checking into a hotel.",
        "Tell someone how to pack a suitcase.",
        "Give tips for a long road trip.",
        "Tell someone how to get to the airport.",
        "Give safety instructions for flying.",
        "Tell a traveler how to stay safe abroad.",
        "Give steps to book a train ticket online.",
        "Tell someone how to prepare for a hiking trip.",
        "Give instructions to find your hotel room."
      ],
      "Work & School": [
        "Tell someone how to log into their email.",
        "Give advice for doing a presentation.",
        "Tell a new colleague how to use the printer.",
        "Give steps to write a simple email.",
        "Tell someone how to join a video call.",
        "Give instructions to make a good impression.",
        "Tell a classmate how to prepare for a test.",
        "Give tips for working in a group.",
        "Tell a student how to use the library.",
        "Give directions to the staff room or office."
      ],
      "Technology": [
        "Tell someone how to charge their phone.",
        "Give steps to reset a password.",
        "Tell someone how to install an app.",
        "Give tips to stay safe online.",
        "Tell a friend how to send a message on WhatsApp.",
        "Give instructions for restarting a laptop.",
        "Tell someone how to clean a screen safely.",
        "Give advice for taking good photos.",
        "Tell someone how to update their software.",
        "Give steps for turning off notifications."
      ],
      "Hobbies & Free Time": [
        "Tell someone how to play your favorite game.",
        "Give instructions for painting something simple.",
        "Tell a friend how to make a playlist.",
        "Give tips for enjoying a walk outside.",
        "Tell someone how to start a collection.",
        "Give advice for learning a new hobby.",
        "Tell someone how to play a card game.",
        "Give instructions for relaxing at home.",
        "Tell a friend how to start journaling.",
        "Give steps for organizing a fun weekend plan."
      ],
      "Health & Fitness": [
        "Tell someone how to stretch before a workout.",
        "Give tips for drinking more water.",
        "Tell a friend how to do jumping jacks.",
        "Give steps for getting a good night's sleep.",
        "Tell someone how to warm up before running.",
        "Give instructions to prepare a healthy snack.",
        "Tell a beginner how to do push-ups.",
        "Give advice for reducing stress at home.",
        "Tell someone how to rest when they’re sick.",
        "Give steps to calm down after a long day."
      ]
    }
  }
}